app/Controllers/Admin.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '6'
---
    public function verProducto($id)
    {
        $productoModel = new \App\Models\ProductoModel();
        $producto = $productoModel->find($id);