app/Controllers/Admin.php

SELECT *
FROM `pedidos`
WHERE `empresa_id` = '2'
ORDER BY `fecha_pedido` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pedidos`
WHERE `empresa_id` = '2'
AND DATE(fecha_pedido) = '2025-11-30'
SELECT SUM(`total`) AS `total`
FROM `pedidos`
WHERE `empresa_id` = '2'
AND DATE(fecha_pedido) = '2025-11-30'
SELECT `productos`.`nombre`, SUM(pedido_items.cantidad) as total_vendido
FROM `pedido_items`
JOIN `pedidos` ON `pedidos`.`id` = `pedido_items`.`pedido_id`
JOIN `productos` ON `productos`.`id` = `pedido_items`.`producto_id`
WHERE `pedidos`.`empresa_id` = '2'
AND `pedidos`.`fecha_pedido` >= '2025-10-30'
GROUP BY `pedido_items`.`producto_id`
ORDER BY `total_vendido` DESC
 LIMIT 1
---
    public function index()
    {
        try {
            $empresaId = $this->getEmpresaId();
            $pedidoModel = new \App\Models\PedidoModel();
            $pedidoItemModel = new \App\Models\PedidoItemModel();
            $productoModel = new \App\Models\ProductoModel();

            // Obtener pedidos recientes del restaurante
            $data['pedidos'] = $pedidoModel->where('empresa_id', $empresaId)->orderBy('fecha_pedido', 'DESC')->limit(10)->findAll();

            // Estadísticas del día
            $pedidosHoy = $pedidoModel->where('empresa_id', $empresaId)->where('DATE(fecha_pedido)', date('Y-m-d'))->countAllResults();

            // Ventas del día (suma de totales de pedidos)
            $ventasHoyResult = $pedidoModel->where('empresa_id', $empresaId)
                                          ->where('DATE(fecha_pedido)', date('Y-m-d'))
                                          ->selectSum('total')
                                          ->get()
                                          ->getRow();
            $ventasHoy = $ventasHoyResult ? $ventasHoyResult->total : 0;

            // Producto más vendido del último mes
            $productoTopResult = $pedidoItemModel
                ->select('productos.nombre, SUM(pedido_items.cantidad) as total_vendido')
                ->join('pedidos', 'pedidos.id = pedido_items.pedido_id')
                ->join('productos', 'productos.id = pedido_items.producto_id')
                ->where('pedidos.empresa_id', $empresaId)
                ->where('pedidos.fecha_pedido >=', date('Y-m-d', strtotime('-1 month')))
                ->groupBy('pedido_items.producto_id')
                ->orderBy('total_vendido', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();

SELECT *
FROM `productos`
WHERE `empresa_id` = '2'
---
    public function menu()
    {
        $categoriaModel = new \App\Models\CategoriaModel();
        $productoModel = new \App\Models\ProductoModel();
        $empresaId = $this->getEmpresaId();

        $data = [
            'categorias' => $categoriaModel->where('empresa_id', $empresaId)->orderBy('orden', 'ASC')->findAll(),
            'productos' => $productoModel->where('empresa_id', $empresaId)->findAll()

SELECT *
FROM `categorias`
WHERE `empresa_id` = '2'
AND `activo` = 1
---
    public function editarProducto($id)
    {
        $productoModel = new \App\Models\ProductoModel();
        $categoriaModel = new \App\Models\CategoriaModel();

        $empresaId = $this->getEmpresaId();
        $data = [
            'producto' => $productoModel->find($id),
            'categorias' => $categoriaModel->where('empresa_id', $empresaId)->where('activo', 1)->findAll()

SELECT *
FROM `pedidos`
WHERE `empresa_id` = '1'
AND DATE(fecha_pedido) = '2025-12-01'
ORDER BY `fecha_pedido` DESC
---
    public function pedidos()
    {
        $pedidoModel = new \App\Models\PedidoModel();

        // Filtros
        $fecha = $this->request->getGet('fecha') ?? date('Y-m-d');
        $estado = $this->request->getGet('estado') ?? '';

        $empresaId = $this->getEmpresaId();
        $query = $pedidoModel->where('empresa_id', $empresaId);

        if ($fecha) {
            $query->where('DATE(fecha_pedido)', $fecha);
        }

        if ($estado) {
            $query->where('estado', $estado);
        }

        $data = [
            'pedidos' => $query->orderBy('fecha_pedido', 'DESC')->findAll(),
            'fecha_filtro' => $fecha,
            'estado_filtro' => $estado
        ];

SELECT *
FROM `pedidos`
WHERE `id` = '44'
AND `empresa_id` = '8'
 LIMIT 1
SELECT `pedido_items`.*, `productos`.`nombre` as `producto_nombre`
FROM `pedido_items`
JOIN `productos` ON `productos`.`id` = `pedido_items`.`producto_id`
WHERE `pedido_id` = '44'
---
    public function verPedido($id)
    {
        $pedidoModel = new \App\Models\PedidoModel();
        $pedidoItemModel = new \App\Models\PedidoItemModel();

        // Verificar que el pedido pertenece a la empresa del usuario
        $empresaId = $this->getEmpresaId();
        $pedido = $pedidoModel->where('id', $id)->where('empresa_id', $empresaId)->first();

        if (!$pedido) {
            return $this->response->setJSON(['success' => false, 'message' => 'Pedido no encontrado']);
        }

        // Obtener items del pedido con información del producto
        $items = $pedidoItemModel->select('pedido_items.*, productos.nombre as producto_nombre')
                                ->join('productos', 'productos.id = pedido_items.producto_id')
                                ->where('pedido_id', $id)
                                ->findAll();

SELECT *
FROM `empresas`
WHERE `empresas`.`id` = '2'
SELECT *
FROM `usuarios`
WHERE `empresa_id` = '1'
---
    public function configuracion()
    {
        $usuarioModel = new \App\Models\UsuarioModel();
        $empresaModel = new \App\Models\EmpresaModel();

        // Empresa actual
        $empresaId = $this->getEmpresaId();
        $empresa = $empresaModel->find($empresaId);

        // Simular usuario desde empresa
        $usuario = [
            'nombre' => $empresa['nombre'],
            'email' => $empresa['email']
        ];

        // Usuarios de la empresa
        $usuarios = $usuarioModel->where('empresa_id', $empresaId)->findAll();

SELECT *
FROM `usuarios`
WHERE `id` = '2'
AND `empresa_id` = '1'
 LIMIT 1
---
    public function actualizarUsuario()
    {
        $usuarioModel = new \App\Models\UsuarioModel();
        $userId = $this->request->getPost('user_id');
        $empresaId = $this->getEmpresaId();

        // Verificar que el usuario pertenece a la empresa
        $usuarioActual = $usuarioModel->where('id', $userId)->where('empresa_id', $empresaId)->first();

UPDATE `usuarios` SET `nombre` = 'mesero', `password` = '$2y$10$XPD3zE7hNFnIKvjZyIemsOlhjVKKATS5YlPhHAyqpZQoVuYS6nwxa'
WHERE `id` = '3'
---

        try {
            $db = \Config\Database::connect();
            $result = $db->table('usuarios')->where('id', $userId)->update($data);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '2'
---
        if ($result) {
            // Actualizar sesión si es el usuario actual
            if (session()->get('user_email') === $usuarioActual['email']) {
                $usuarioActualizado = $usuarioModel->find($userId);