app/Controllers/Empresas.php

    public function index()
    {
        $filtros = $this->request->getGet();

        $builder = $this->empresaModel;

        if (!empty($filtros['estado'])) {
            $builder = $builder->where('estado', $filtros['estado']);
        }

        if (!empty($filtros['plan'])) {
            $builder = $builder->where('plan', $filtros['plan']);
        }

        if (!empty($filtros['ciudad'])) {
            $builder = $builder->like('ciudad', $filtros['ciudad']);
        }

        // Contar solicitudes pendientes
        $db = \Config\Database::connect();
        $solicitudesPendientes = $db->table('solicitudes_registro')
                                   ->where('estado', 'pendiente')
                                   ->countAllResults();

        $data = [
            'empresas' => $builder->findAll(),
            'filtros' => $filtros,
            'ciudades' => $this->empresaModel->select('ciudad')->distinct()->findAll(),
            'solicitudes_pendientes' => $solicitudesPendientes
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `solicitudes_registro`
WHERE `estado` = 'pendiente'
SELECT DISTINCT `ciudad`
FROM `empresas`

    public function actualizar($id)
    {
        $empresa = $this->empresaModel->find($id);
---
SELECT *
FROM `empresas`
WHERE `empresas`.`id` = '1'

                'codigo_referido' => $this->request->getPost('codigo_referido')
            ];

            $this->empresaModel->update($id, $data);
---
UPDATE `empresas` SET `nombre` = 'Galvis Café', `email` = 'admin@galvis.com', `telefono` = '3163127002', `direccion` = 'Calle 12#45-67, zipakira', `descripcion` = 'el mejor cafe del mundo', `ciudad` = 'VALLEDUPAR', `categoria_comida` = 'CAFETERIA', `plan` = 'premium', `estado` = 'activo', `envio_gratis` = 1, `descuento_activo` = 0, `oferta_2x1` = 0, `destacado` = 1, `activo` = 1
WHERE `empresas`.`id` IN ('1')