app/Controllers/Login.php

    public function authenticate()
    {
        try {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            if (!$email || !$password) {
                return redirect()->back()->with('error', 'Email y contraseña son requeridos');
            }

            $db = \Config\Database::connect();
            $empresa = $db->table('empresas')
                ->select('id, nombre, email, password, activo')
                ->where('email', $email)
                ->where('activo', 1)
                ->get()
                ->getRowArray();
---
SELECT `id`, `nombre`, `email`, `password`, `activo`
FROM `empresas`
WHERE `email` = 'info@donmario.com'
AND `activo` = 1


            if ($passwordValid) {
                // Buscar usuario asociado a la empresa
                $usuario = $db->table('usuarios')
                    ->select('nombre, email, foto_perfil, rol')
                    ->where('empresa_id', $empresa['id'])
                    ->where('activo', 1)
                    ->get()
                    ->getRowArray();
---
SELECT `nombre`, `email`, `foto_perfil`, `rol`
FROM `usuarios`
WHERE `empresa_id` = '2'
AND `activo` = 1
ORDER BY `id` ASC