app/Controllers/Notificaciones.php

SELECT *
FROM `pedidos`
WHERE `empresa_id` = '8'
AND `id` > '56'
AND `estado` = 'pendiente'
ORDER BY `id` DESC
---
    public function checkNuevosPedidos()
    {
        $ultimoId = $this->request->getGet('ultimo_id') ?? 0;
        $empresaId = session()->get('empresa_id') ?? 1;
        $db = \Config\Database::connect();

        $nuevosPedidos = $db->table('pedidos')
            ->where('empresa_id', $empresaId)
            ->where('id >', $ultimoId)
            ->where('estado', 'pendiente')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();