app/Controllers/Pedidos.php

SELECT *
FROM `pedidos`
WHERE `empresa_id` = '1'
ORDER BY `id` DESC
SELECT `costo_envio`
FROM `empresas`
WHERE `id` = '1'
---
    public function crear()
    {
        $request = $this->request->getJSON();

        if (!$request) {
            return $this->response->setJSON(['success' => false, 'message' => 'Datos inválidos']);
        }

        $db = \Config\Database::connect();

        // Generar número de pedido alfanumérico
        $restauranteNombre = strtolower($request->restaurante->nombre);
        $restauranteSlug = preg_replace('/[^a-z0-9]/', '', $restauranteNombre);
        $restauranteSlug = substr($restauranteSlug, 0, 6);

        // Obtener siguiente número secuencial para este restaurante
        $ultimoPedido = $db->table('pedidos')
            ->where('empresa_id', $request->restaurante->id)
            ->orderBy('id', 'DESC')
            ->get()
            ->getRowArray();

        $numeroSecuencial = $ultimoPedido ? (intval(substr($ultimoPedido['numero_pedido'], -4)) + 1) : 1;
        $numeroPedido = $restauranteSlug . '-' . str_pad($numeroSecuencial, 4, '0', STR_PAD_LEFT);

        // Obtener costo de envío de la empresa
        $empresa = $db->table('empresas')
                     ->select('costo_envio')
                     ->where('id', $request->restaurante->id)
                     ->get()
                     ->getRowArray();

INSERT INTO `pedidos` (`numero_pedido`, `empresa_id`, `cliente_nombre`, `cliente_telefono`, `direccion_entrega`, `notas`, `medio_pago`, `subtotal`, `costo_envio`, `total`, `estado`, `fecha_pedido`) VALUES ('galvis-0040', '1', 'asjkdkadsj', '21323', 'aksdakjsd', 'alksdakjsd', 'efectivo', 26.5, 3, 29.5, 'pendiente', '2025-12-01 23:57:40')
---
            'fecha_pedido' => date('Y-m-d H:i:s')
        ];

        $insertResult = $db->table('pedidos')->insert($pedidoData);

INSERT INTO `pedido_items` (`pedido_id`, `producto_id`, `cantidad`, `precio_unitario`, `subtotal`) VALUES (53, '2', 1, 8, 8)
---

        // Insertar items del pedido
        foreach ($request->items as $item) {
            $db->table('pedido_items')->insert([
                'pedido_id' => $pedidoId,
                'producto_id' => $item->id,
                'cantidad' => $item->cantidad,
                'precio_unitario' => $item->precio,
                'subtotal' => $item->precio * $item->cantidad
            ]);