app/Controllers/Restaurantes.php

    public function verPorNombre($nombreRestaurante)
    {
        $db = \Config\Database::connect();

        // Buscar empresa por nombre (convertir URL a nombre)
        $nombreBuscar = str_replace('-', ' ', $nombreRestaurante);
        $empresa = $db->table('empresas')
            ->where('LOWER(nombre)', strtolower($nombreBuscar))
            ->where('estado', 'activo')
            ->get()
            ->getRowArray();

        if (!$empresa) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Obtener productos con sus categorías
        $productos = $db->table('productos p')
            ->select('p.*, c.nombre as categoria_nombre')
            ->join('categorias c', 'p.categoria_id = c.id', 'left')
            ->where('p.empresa_id', $empresa['id'])
            ->where('p.activo', 1)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `empresas`
WHERE LOWER(nombre) = 'galvis cafe'
AND `estado` = 'activo'
SELECT `p`.*, `c`.`nombre` as `categoria_nombre`
FROM `productos` `p`
LEFT JOIN `categorias` `c` ON `p`.`categoria_id` = `c`.`id`
WHERE `p`.`empresa_id` = '1'
AND `p`.`activo` = 1

        }

        // Obtener productos destacados
        $destacados = $db->table('productos')
            ->where('empresa_id', $empresa['id'])
            ->where('activo', 1)
            ->where('destacado', 1)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `productos`
WHERE `empresa_id` = '1'
AND `activo` = 1
AND `destacado` = 1