app/Controllers/Restaurantes.php

    public function verPorNombre($nombreRestaurante)
    {
        $db = \Config\Database::connect();

        // Buscar empresa por nombre (convertir URL a nombre)
        $nombreBuscar = str_replace('-', ' ', $nombreRestaurante);
        $empresa = $db->table('empresas')
            ->where('LOWER(nombre)', strtolower($nombreBuscar))
            ->where('activo', 1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `empresas`
WHERE LOWER(nombre) = 'galvis cafe'
AND `activo` = 1