app/Models/EmpresaModel.php

SELECT `ciudad`
FROM `empresas`
WHERE `estado` = 'activo'
GROUP BY `ciudad`
ORDER BY `ciudad` ASC
---
    public function getCiudades()
    {
        return $this->select('ciudad')
                   ->where('estado', 'activo')
                   ->groupBy('ciudad')
                   ->orderBy('ciudad', 'ASC')
                   ->findAll();

SELECT `categoria_comida`
FROM `empresas`
WHERE `estado` = 'activo'
AND `categoria_comida` IS NOT NULL
GROUP BY `categoria_comida`
ORDER BY `categoria_comida` ASC
---
    public function getCategorias()
    {
        try {
            return $this->select('categoria_comida')
                       ->where('estado', 'activo')
                       ->where('categoria_comida IS NOT NULL')
                       ->groupBy('categoria_comida')
                       ->orderBy('categoria_comida', 'ASC')
                       ->findAll();